driver-tests/bpelse/foreach-bpel20/ForEachJbi/test/forEach_branches/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:for="http://localhost/ForEachBpel/forEach_branches1">
  <soapenv:Body>
    <for:part1>1</for:part1>
    <for:part2>5</for:part2>
    <for:part3>3</for:part3>
  </soapenv:Body>
</soapenv:Envelope>